tap "common-fate/granted"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
brew "bash"
brew "bat"
brew "xz"
brew "commitizen"
brew "exercism"
brew "fzf"
brew "jq"
brew "kubernetes-cli", link: false
brew "minikube"
brew "neovim"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ranger"
brew "ripgrep"
brew "spotify-tui"
brew "tcl-tk", link: false
brew "tmux"
brew "wget"
brew "yadm"
brew "zlib"
brew "zsh"
brew "common-fate/granted/granted"
brew "hashicorp/tap/terraform"
brew "jesseduffield/lazygit/lazygit"
cask "alt-tab"
cask "font-hack-nerd-font"
cask "warp"
vscode "42Crunch.vscode-openapi"
vscode "4ops.packer"
vscode "adpyke.vscode-sql-formatter"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "cschlosser.doxdocgen"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.github-actions"
vscode "foxundermoon.shell-format"
vscode "frhtylcn.pythonsnippets"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "Infracost.infracost"
vscode "jeff-hykin.better-cpp-syntax"
vscode "maziac.asm-code-lens"
vscode "monosans.djlint"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "phplasma.csv-to-table"
vscode "pustelto.bracketeer"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "scala-lang.scala"
vscode "SonarSource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "Tim-Koehler.helm-intellisense"
vscode "tomoki1207.pdf"
vscode "tootone.org-mode"
vscode "twxs.cmake"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscode-org-mode.org-mode"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "william-voyek.vscode-nginx"
