tap "common-fate/granted"
tap "gromgit/fuse"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "jesseduffield/lazygit"
tap "powershell/tap"
brew "atuin"
brew "xz"
brew "awscli"
brew "azure-cli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "binutils"
brew "bitwarden-cli"
brew "bmake"
brew "cfn-lint"
brew "commitizen"
brew "gmp"
brew "coreutils"
brew "wget"
brew "dasht"
brew "exercism"
brew "fzf"
brew "gh"
brew "glances"
brew "grpcurl"
brew "hugo"
brew "isl"
brew "jq"
brew "kubernetes-cli"
brew "mpfr"
brew "libmpc"
brew "mackup"
brew "make"
brew "minikube"
brew "neovim"
brew "pipx"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ranger"
brew "ripgrep"
brew "skaffold"
brew "tcl-tk", link: false
brew "telnet"
brew "terragrunt"
brew "tldr"
brew "tmux"
brew "yadm"
brew "zlib"
brew "zsh"
brew "common-fate/granted/granted"
brew "hashicorp/tap/terraform"
brew "jesseduffield/lazygit/lazygit"
brew "powershell/tap/powershell"
cask "alt-tab"
cask "docker"
cask "font-hack-nerd-font"
cask "notion"
cask "notion-calendar"
cask "raycast"
cask "rectangle"
cask "stats"
cask "visual-studio-code"
cask "warp"
vscode "ahmadalli.vscode-nginx-conf"
vscode "aws-scripting-guy.cform"
vscode "bradlc.vscode-tailwindcss"
vscode "chaitanyashahare.lazygit"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "kddejong.vscode-cfn-lint"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.vscode-speech"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-yaml"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "william-voyek.vscode-nginx"
